
def schema_prompt(chunk_pdf_bytes: bytes=None):


    prompt = """จากในไฟล์ที่ทำการ extract เรียงจากบนลงล่าง ห้ามตอบคำอธิบายอื่น ให้ตอบเป็น JSON อย่างเดียว ตาม schema ที่กำหนด
        หมวดที่ 7

        assessement_grade จาก การประเมินผลการเรียนของนักศึกษา (เอาข้อความมาทั้งหมด หากมีหลายข้อรวมถึงหลายข้อย่อย หัวข้อย่อดูจากเลขว่าเป็นแยกย่อยของหัวข้อหลักไหม ให้หัวข้อหลักหลายๆข้ออยู่ใน '{}' แล้วคั่นด้วย ',' ส่วนหัวข้อย่อยต่างๆก็ให้ใส่วงเล็บ '{}' หลังแต่ละหัวข้อหลักและใส่',' คั่นไว้เช่นกัน),

        review_achievement_standard จาก กระบวนการทวนสอบมาตรฐานผลสัมฤทธิ์ของนักศึกษา (เอาข้อความมาทั้งหมด หากมีหลายข้อรวมถึงหลายข้อย่อย หัวข้อย่อดูจากเลขว่าเป็นแยกย่อยของหัวข้อหลักไหม ให้หัวข้อหลักหลายๆข้ออยู่ใน '{}' แล้วคั่นด้วย ',' ส่วนหัวข้อย่อยต่างๆก็ให้ใส่วงเล็บ '{}' หลังแต่ละหัวข้อหลักและใส่',' คั่นไว้เช่นกัน),

        grade_appeal จาก การอุทธรณ์ผลการศึกษาของนักศึกษา (เอาข้อความมาทั้งหมด),

        criteria_graduate จาก เกณฑ์การสําเร็จการศึกษาตามหลักสูตร (เอาข้อความมาทั้งหมด ไม่เอาเลขลำดับข้อ หากมีหลายข้อย่อย ให้คั่นแต่ละข้อด้วยการใช้ลูกน้ำ ',' ),

        """


    schema = {
        "type": "object",
        "properties": {
            "assessement_grade": {"type": ["string", "null"]},
            "review_achievement_standard": {"type": ["string", "null"]},
            "grade_appeal": {"type": ["string", "null"]},
            "criteria_graduate": {"type": ["string", "null"]},
        },
        "additionalProperties": False,
        "required": []
    }


    return schema, prompt