
def schema_prompt(chunk_pdf_bytes: bytes=None):


    prompt = """จากในไฟล์ที่ทำการ extract เรียงจากบนลงล่าง ห้ามตอบคำอธิบายอื่น ให้ตอบเป็น JSON อย่างเดียว ตาม schema ที่กำหนด
    หมวดที่ 5

    (หมวดนี้อยู่ใน การพัฒบุคคลตามวิชาชีพหรือศาสตร์ มีหัวตารางคือ คุณลักษณะของนักศึกษา และ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) โดยคำว่าคุณลักษณะบุคคลทั่วไป และ คุณลักษณะบุคคลตามวิชาชีพหรือศาสตร์ คุณลักษณะของนักศึกษา การพัฒนาหลักสูตร พร้อมข้อความอื่นๆ โดยบางทีตารางก็ออกมาในรุปแบบ 2*2 บางอันแบ่ง row ของแต่ละ คุณลักษณะของนักศึกษา รวมถึงวิธีการดําเนินการ ด้วย บางทีตารางอาจถูกตัดจากหน้าที่เปลี่ยนไปให้เช็คด้วย)
    general_character คุณลักษณะของนักศึกษา ของ คุณลักษณะบุคคลทั่วไป (หากมีหลายข้อ ไม่ต้องเอาละดับมาเอามาแค่ข้อ และใส่ ',' คั่น)
    plo_general_character ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) ของ คุณลักษณะบุคคลทั่วไป (หากมีหลายข้อ ไม่ต้องเอาละดับมาเอามาแค่ข้อ และใส่ ',' คั่น  และไม่เอาตัวที่ซ้ำ)
    profession_character คุณลักษณะของนักศึกษา ของ คุณลักษณะบุคคลตามวิชาชีพหรือศาสตร์ (หากมีหลายข้อ ไม่ต้องเอาละดับมาเอามาแค่ข้อ และใส่ ',' คั่น)
    plo_profession_character ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) ของ คุณลักษณะบุคคลตามวิชาชีพหรือศาสตร์ (หากมีหลายข้อ ไม่ต้องเอาละดับมาเอามาแค่ข้อ และใส่ ',' คั่น และไม่เอาตัวที่ซ้ำ)

    """

    # มีตัวแปรซ้ำ: credit (ซ้ำหลายชั้น), year (ซ้ำหลายชั้น), plo_expectation (ซ้ำเป็นชื่อฟิลด์หลักและชื่อฟิลด์ย่อย), detail_plo (ซ้ำหลายชั้น)

    schema = {
        "type": "object",
        "properties": {
            "general_character": {"type": ["string", "null"]},
            "plo_general_character": {"type": ["string", "null"]},
            "profession_character": {"type": ["string", "null"]},
            "plo_profession_character": {"type": ["string", "null"]},

        },
        "required": [],
        "additionalProperties": False,
    }


    return schema, prompt