
def schema_prompt(chunk_pdf_bytes: bytes=None):


    prompt = """จากในไฟล์ที่ทำการ extract เรียงจากบนลงล่าง ห้ามตอบคำอธิบายอื่น ให้ตอบเป็น JSON อย่างเดียว ตาม schema ที่กำหนด
        ข้อมูลจากหมวดที่ 9

        (จากหัวข้อ การประเมินประสิทธิผลของการสอน โดยจะแบ่งออกเป็นสองหัวข้อ)
        rate_course จาก การประเมินประสิทธิผลของการสอนระดับรายวิชา (เอาข้อความมาทั้งหมด หากมีหลายข้อรวมถึงหลายข้อย่อย หัวข้อย่อดูจากเลขว่าเป็นแยกย่อยของหัวข้อหลักไหม ให้หัวข้อหลัก แล้วคั่นด้วย ',' ส่วนหัวข้อย่อยต่างๆให้ใส่วงเล็บ '{}' หลังแต่ละหัวข้อหลักและใส่',' คั่นไว้เช่นกัน)(เอาข้อความมาทั้งหมด หากมีหลายข้อรวมถึงหลายข้อย่อย ให้หัวข้อหลัก แล้วคั่นด้วย ',' หากข้อมูลเป็นรูปแบบตาราง ให้แบ่งแต่ละข้อเป็น ใครประเมิณ ประเมิณอะไร วิธีการประเมิณ และช่วงเวลา),
        rate_lecturer จาก การประเมินการจัดการเรียนการสอนของอาจารย์ (เอาข้อความมาทั้งหมด หากมีหลายข้อรวมถึงหลายข้อย่อย หัวข้อย่อดูจากเลขว่าเป็นแยกย่อยของหัวข้อหลักไหม ให้หัวข้อหลัก แล้วคั่นด้วย ',' ส่วนหัวข้อย่อยต่างๆให้ใส่วงเล็บ '{}' หลังแต่ละหัวข้อหลักและใส่',' คั่นไว้เช่นกัน)(เอาข้อความมาทั้งหมด หากมีหลายข้อรวมถึงหลายข้อย่อย ให้หัวข้อหลัก แล้วคั่นด้วย ',' หากข้อมูลเป็นรูปแบบตาราง ให้แบ่งแต่ละข้อเป็น ใครประเมิณ ประเมิณอะไร วิธีการประเมิณ และช่วงเวลา),

        rate_curr จากหัวข้อ การประเมินหลักสูตรในภาพรวม/ผลการดําเนินงานของหลักสูตร/ผลการประกันคุณภาพการศึกษา (เอาข้อความมาทั้งหมด หากมีหลายข้อรวมถึงหลายข้อย่อย หัวข้อย่อดูจากเลขว่าเป็นแยกย่อยของหัวข้อหลักไหม ให้หัวข้อหลัก แล้วคั่นด้วย ',' ส่วนหัวข้อย่อยต่างๆให้ใส่วงเล็บ '{}' หลังแต่ละหัวข้อหลักและใส่',' คั่นไว้เช่นกัน),

        rate_operation_curr จากหัวข้อ การประเมินผลการดําเนินงานตามรายละเอียดหลักสูตร (เอาข้อความมาทั้งหมด หากมีหลายข้อรวมถึงหลายข้อย่อย หัวข้อย่อดูจากเลขว่าเป็นแยกย่อยของหัวข้อหลักไหม ให้หัวข้อหลัก แล้วคั่นด้วย ',' ส่วนหัวข้อย่อยต่างๆให้ใส่วงเล็บ '{}' หลังแต่ละหัวข้อหลักและใส่',' คั่นไว้เช่นกัน),

        review_development_curr จากหัวข้อ การทบทวนผลการประเมินและวางแผนปรับปรุง/พัฒนาหลักสูตร (เอาข้อความมาทั้งหมด),

        (ต่อจากนี้จะเป็น field ที่อยู่ในตาราง ของหัวข้อ แผนปรับปรุงและพัฒนาหลักสูตร โดยเป็นตารางที่มี 2 หัวข้อคือ การพัฒนาหลักสูตร และ วิธีการดําเนินการ โดยคำว่าจุดเด่น และจุดด้อยจะอยู่ในตารางหัวข้อ การพัฒนาหลักสูตร พร้อมข้อความอื่นๆ โดยบางทีตารางก็ออกมาในรุปแบบ 2*2 บางอันแบ่ง row ของแต่ละ การพัฒนาหลักสูตร รวมถึงวิธีการดําเนินการ ด้วย)
        advantage_subject การพัฒนาหลักสูตร ในหัวข้อจุดเด่น (หากมีหลายข้อให้เอามาทุกข้อ ไม่เอาลำดับและใส่ ',' มาคั่นแต่ละข้อ),
        advantage_operation วิธีการดําเนินการ ในหัวข้อจุดเด่น (หากมีหลายข้อให้เอามาทุกข้อ ไม่เอาลำดับและใส่ ',' มาคั่นแต่ละข้อ),
        improvement_subject การพัฒนาหลักสูตร ในหัวข้อจุดด้อย/จุดพัฒนา (หากมีหลายข้อให้เอามาทุกข้อ ไม่เอาลำดับและใส่ ',' มาคั่นแต่ละข้อ),
        improvement_operation วิธีการดําเนินการ ในหัวข้อจุดด้อย/จุดพัฒนา (หากมีหลายข้อให้เอามาทุกข้อ ไม่เอาลำดับและใส่ ',' มาคั่นแต่ละข้อ),
        """



    schema = {
        "type": "object",
        "properties": {
            "rate_course": {"type": ["string", "null"]},
            "rate_lecturer": {"type": ["string", "null"]},
            "rate_curr": {"type": ["string", "null"]},
            "rate_operation_curr": {"type": ["string", "null"]},
            "review_development_curr": {"type": ["string", "null"]},
            "advantage_subject": {"type": ["string", "null"]},
            "advantage_operation": {"type": ["string", "null"]},
            "improvement_subject": {"type": ["string", "null"]},
            "improvement_operation": {"type": ["string", "null"]},
        },
        "additionalProperties": False,
        "required": []
    }



    return schema, prompt
